# 함수
# 특정 작업을 수행하는 명령어의 모음
# 함수는 작업에 따라 필요한 데이터를 전달(매개변수, 인자값, parameter, arguments) 받을 수 있으며
# 작업이 완료 된 후에는 작업의 결과를 호출한 곳으로 반환 할 수 있다.

# 함수의 필요성
# 컴퓨터의 자원은 한정되어 있다. 프로그램 코드를 저장할 수 있는 공간도 한정되어 있다. 동일한 처리를
# 반복할 경우 작성해 둔 코드를 사용해 자원을 효율적으로 쓸 수 있다.

# 함수는 객체지향 프로그래밍 언어에서는 메서드라고 한다.


# 함수 선언 및 구현
# 함수 문법
def 함수이름 (매개변수1, 매개변수1, 매개변수1, ...):

    몸체(구현)

    return 리턴값
# 매개변수는 외부에서 전달되는 데이터를 함수로 전달하는 변수

# 함수의 장점
# 프로그램 안에서 중복되 코드를 제거
# 복잡한 프로그래밍 작업을 간단한 작업으로 분해
# 함수를 만들면 다른 프로그램에서도 쓸 수 있음
# 가독성이 증대되며, 유지 관리도 쉬워짐
# https://docs.python.org/3.8/ 에서 내장된 함수의 사용법을 알 수 있다.








