# 변수: 값을 저장하는 공간(스택이라는 공간에 저장)
# 변수에 값을 저장하는 문장을 할당문(assignment statement) 또는 대입문이라 한다.
# = 연산자는 같다란느 의미가 아니라 변수에 값을 저장한다는 의미
# 함수명(x) ,x는 매개변수, 파라메터, 인자값, 아규먼츠
# 문자열, 싱글코테이션('')이나 더블 코테이션("") 안에 작성해야 한다.
# 1,100,9583 와 같은 그 자체로 의미있는 literal은 변수로 저장할 수 없다.

# 변수가 저장하는 것: 정수, 실수, 문자열

# #** 파이썬이 어떤 자료형의 데이터 든지 저장할 수 있는 것은 파이썬에서는 모든
# 것이 객체(object)로 되어 있기 때문이다. 변수에 저장되는 것은 실제로 객체의
# 주소이다. 따라서 객체이기만 하면 뭐든지 변수로 가리킬 수 있는 것이다.

# 변수 이름 규칙
# 의미를 나타내는 이름을 사용한다.
# 소문자와 대문자는 서로 다르게 취급한다.
# 변수의 이름은 영문자와 숫자, 밑줄(_)로 이루어진다.
# 변수의 이름 중간에 공백이 들어가면 안된다. 단어를 구분하려면 _를 사용한다.

# 상수의 이름은 통상 대문자로 작성하는 것이 관례적이다.
# ex) TAX_RATE = 0.35, PI = 3.141592, MAX_SIZE=100
#
# TAX_RATE = 0.35
# tax = 1000*TAX_RATE
# income = 1000-tax
# print('현재의 세율은',TAX_RATE*100,'%입니다.')
# 상수의 변경사항이 있을 때 상수값만 변경해 유지 보수에 도움이 된다.

# 주석
# 소스 코드에 붙이는 설명글
# 반드시 있어야 하는 부분은 아니다.
# 자신이 개발한 코드여도 어려운 코드이면 나중에 볼때 어려울 수 있다.

